package Task_06;

/*
Написать абстрактный класс Гирлянда. Расширить его классами простой и цветной гирлянды.

В качестве элементов гирлянды использовать класс Лампочка и Цветная Лампочка. Цветная лампочка имеет цвет который может быть красным, желтым, синим или зеленым.
Для цветной лампочки должно быть возможно установить цвет с помощью типа Цвет, и получить цвет в виде строки
Для цветной гирлянды при создании установить цвет лампочки в зависимости от кратности порядкового номера(1 - красная, 2 - желтая, 3 - зеленая, 4 - синяя, 5 - красная, и тд.)
Количество лампочек гирлянды задается пользователем.

Состояние лампочки(вкл-выкл) вычисляется от ее порядкового номера в гирлянде и текущей минуты времени.
В случае если текущая минута четная - горят только лампочки с четным номером в гирлянде. В случае если текущая минута нечетная - горят лампочки с нечетным номером.

Для обоих гирлянд создать метод выводящий на печать текущее состояние лампочек(включена-выключена) и цвет в случае цветной гирлянды.

Вывести на консоль текущее состояние обоих гирлянд.
*/

public class Garland {


}
